"""
Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

Пример:

- [2, 3, 4, 5, 6] => [12, 15, 16];
- [2, 3, 5, 6] => [12, 15]

"""
arr = [2, 3, 4, 5, 6]
for i in range(int(round(len(arr) / 2 + 0.000001))):
    x = arr[i] * arr[len(arr) - i - 1]
    print(x)


# for i in range(int(math.ceil(len(list)/2))):